#define _CRT_SECURE_NO_WARING
#include <stdio.h>


//1.原码、反码、补码的正确说法
//①一个数的原码是这个数直接转化成二进制
//②反码是原码的二进制符号位不变，其他位按位取反
//③补码是反码的二进制加1
 
 

// 2.关于大小端字节序的正确描述
//①大小端字节序指的是数组在电脑上存储的字节顺序
//②大端字节序逆序存储：高字节内容存放低字节，低字节内容存放在高地址处
//③小端字节序顺序存储：高字节内容存放高地址，低字节内容存放在低地址处


/*
int main()
{
	unsigned char a = 200;  //unsigned char - 1个字节 - 8bit位
	unsigned char b = 100;  //0-255
	unsigned char c = 0;    

	c = a + b; //整形提升
	//00000000000000000000000011001000 - a
	//00000000000000000000000001100100 - b
	//00000000000000000000000100101100 只能存储8位
	//00101100 - c
	//00000000000000000000000000101100 - 整形提升 -补码也是原码
	//打印：00101100 - 正数的原反补码相同
	printf("%d %d", a + b, c);//输出结果：300 ；44
	return 0;
}
*/


/*
int main()
{
	unsigned in a = 0x1234;
	unsigned char b = *(unsigned char*)&a;//一个字节
	return 0;
}
//在32位大端模式处理器上变量b等于：0x00
*/


/*
int main()
{
	char a[1000] = { 0 };
	int i = 0;
	for (i = 0; i < 1000; i++)
	{
		a[i] = -1 - i;
	}
	printf("%d", strlen(a));//输出结果：255
	return 0;
}
*/ 





//打印杨辉三角
/*
int main()
{
	int arr[10][10] = { 0 };
	int i = 0;
	int j = 0;
	for (i = 0; i < 10; i++)
	{
		for (j = 0; j < 10; j++)
		{
			if (j == 0)
			{
				arr[i][j] = 1;
			}
			if (i == j)
			{
				arr[i][j] = 1;
			}
			if (i >= 2 && j >= 1)
			{
				arr[i][j] = arr[i - 1][j] + arr[i - 1][j - 1];
			}
		}
	}
	//打印
	for (i = 0; i < 10; i++)
	{
		for (j = 0; j <= i; j++)
		{
			printf("%d ", arr[i][j]);
		}
		printf("\n");
	}
	return 0;
}
*/




//猜凶手：a说：不是我； b说：是c； c说：是d； d说：c在胡说； 
//已知三个人说了真话，1个人说的是假话
/*
int main()
{
	int killer = 0;
	for (killer = 'a'; killer <= 'd'; killer++)
	{
		if ((killer != 'a') + (killer == 'c') + (killer == 'd') + (killer != 'd') == 3)
		{
			printf("killer = %c\n", killer);
		}
	}

	return 0;
}
*/


//类似问题
//赛马问题：有36匹马，6个跑道，没有计时器，请赛马确定，36匹马中的前三名
//请问最少比赛几次

//烧香问题
//有一种香，材质不均匀，但是每一根这样的香，燃烧完恰好是一个小时，给你2根香，帮我确定一个15分钟的时间段





//猜名次：5位运动员参加了10米台跳水比赛，有人让他们预测比赛结果
//A选手说：B第二，我第三；
//B选手说：我第二，E第四
//C选手说：我第一，D第二
//D选手说：C最后，我第三
//E选手说：我第四，A第一；
//比赛结束后，每位选手都说对了一半，请编程确定比赛的名词

int main()
{
	int a = 0;
	int b = 0;
	int c = 0;
	int d = 0;
	int e = 0;
	for (a = 1; a <= 5; a++)
	{
		for (b = 1; b <= 5; b++)
		{
			for (c = 1; c <= 5; c++)
			{
				for (d = 1; d <= 5; d++)
				{
					for (e = 1; e <= 5; e++)
					{
						if (((b == 2) + (a == 3) == 1) &&
							((b == 2) + (e == 4) == 1) &&
							((c == 1) + (d == 2) == 1) &&
							((c == 5) + (d == 3) == 1) &&
							((e == 4) + (a == 1) == 1))
						{
							if(a*b*c*d*e == 120)
								printf("a=%d b=%d c=%d d=%d e=%d\n", a, b, c, d, e);
							//输出结果是：3；1；5；2；4
						}
					}
				}
			}
		}
	}
	return 0;
}